Статистика работы механизмов/Конфигурация/DataProcessors/_ПроверкаБанковПоПеречнямЦБРФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ПроверкаБанковПоПеречнямЦБРФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПеречняПо451</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПеречняПо580</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПеречняПо761</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВОтчетТолькоОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПеречняПо451</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПеречняПо580</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПеречняПо761</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ПроверкаБанковПоПеречнямЦБРФ/_ПроверкаБанковПоПеречнямЦБРФ/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПроверитьНаСервере()

	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	
	Если ОбъектНаСервере.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ОбъектНаСервере.ДополнительныеСвойства.Удалить("Ошибки");
	КонецЕсли;
	
	ЭтаФорма.ОтчетHTML = ОбъектНаСервере.СформироватьОтчетОПроверке();
	
	Если ЭтаФорма.ОтправитьОтчетПоЭлПочте И Не ПустаяСтрока(ЭтаФорма.ОтчетHTML) Тогда
		ОбъектНаСервере.ОтправитьОтчетПоЭлПочте(ЭтаФорма.ОтчетHTML);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Объект.Организация       = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.Период            = ТекущаяДата();
	//Объект.АдресПеречняПо451 = "http://cbr.ru/finmarkets/files/supervision/list_451_p.xlsx";
	//Объект.АдресПеречняПо580 = "http://cbr.ru/StaticHtml/File/23521/list_580-p.xlsx";
	//Объект.АдресПеречняПо761 = "http://cbr.ru/StaticHtml/File/23521/list_761-p.xlsx";
	Объект.ИдентификаторПеречняПо451 = "5";
	Объект.ИдентификаторПеречняПо580 = "3";
	Объект.ИдентификаторПеречняПо761 = "4";
		
	Элементы.ПолучателиОтчета.Видимость = ЭтаФорма.ОтправитьОтчетПоЭлПочте;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ОтправитьОтчетПоЭлПочте Тогда
		Если Не ЗначениеЗаполнено(Объект.ПолучателиОтчета) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено поле 'Получатели отчета'", "ПолучателиОтчета",,, Отказ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОтчетПоЭлПочтеПриИзменении(Элемент)
	
	Элементы.ПолучателиОтчета.Видимость = ЭтаФорма.ОтправитьОтчетПоЭлПочте;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверить(Команда)
	
	ПараметрыСессии = ЗарегистрироватьНовуюСессию("КомандаПроверить");
	Попытка
		ВыполнитьКомандаПроверить(ПараметрыСессии);
	Исключение
		ПараметрыСессии.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);
		Возврат;
	КонецПопытки;
	ЗарегистрироватьОкончаниеСессии(ПараметрыСессии);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандаПроверить(ПараметрыСессии)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ПроверитьНаСервере();
		ЭтаФорма.Модифицированность = Ложь;
	Иначе
		ПараметрыСессии.ТекстОшибки = "Проверка заполнения не прошла.";
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьАдресПеречняПоИдентификатору(ИдентификаторПеречня)
	Если ЗначениеЗаполнено(ИдентификаторПеречня) Тогда	
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		
		Перечень = ОбработкаОбъект.ПолучитьПереченьПоИдентификатору(ИдентификаторПеречня);
		Если Перечень <> Неопределено Тогда
			Возврат Перечень.ИмяФайла;
		КонецЕсли;
		
		РаботаСДополнительнымиОтчетамиИОбработками.ОповеститьОВнутрОшибках(ОбработкаОбъект);	
	КонецЕсли;
	
	Возврат "";
КонецФункции

&НаСервере
Процедура ЗаполнитьАдресаПеречнейПоИдентификаторам()
	ИменаПеречней = Новый Структура("ПеречняПо451, ПеречняПо580, ПеречняПо761");	
	Для Каждого Перечень Из ИменаПеречней Цикл
		Если ЗначениеЗаполнено(Объект["Идентификатор" + Перечень.Ключ]) Тогда
			Объект["Адрес" + Перечень.Ключ] = ПолучитьАдресПеречняПоИдентификатору(Объект["Идентификатор" + Перечень.Ключ]);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторПеречняПо451ПриИзменении(Элемент)
	Объект.АдресПеречняПо451 = ПолучитьАдресПеречняПоИдентификатору(Объект.ИдентификаторПеречняПо451);	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторПеречняПо580ПриИзменении(Элемент)
	Объект.АдресПеречняПо580 = ПолучитьАдресПеречняПоИдентификатору(Объект.ИдентификаторПеречняПо580);	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторПеречняПо761ПриИзменении(Элемент)
	Объект.АдресПеречняПо761 = ПолучитьАдресПеречняПоИдентификатору(Объект.ИдентификаторПеречняПо761);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Заполним адреса перечней
	ЗаполнитьАдресаПеречнейПоИдентификаторам();
КонецПроцедуры

&НаКлиенте
Процедура Декорация451Нажатие(Элемент)
	ОткрытьПеречень(Элемент, "451");	
КонецПроцедуры

&НаКлиенте
Процедура Декорация580Нажатие(Элемент)
	ОткрытьПеречень(Элемент, "580");	
КонецПроцедуры

&НаКлиенте
Процедура Декорация761Нажатие(Элемент)
	ОткрытьПеречень(Элемент, "761");	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПеречень(Элемент, НомерПеречня)
	СписокВариантов = Новый СписокЗначений;
	СписокВариантов.Добавить("SQL", "Открыть загруженный файл");
	СписокВариантов.Добавить("HTTP", "Открыть файл с сайта ЦБ РФ");
	
	ВыбранныйВариант = ВыбратьИзМеню(СписокВариантов, Элемент);
	Если ВыбранныйВариант = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеФайлаПеречня = ПолучитьФайлПеречняНаСервере(НомерПеречня, ВыбранныйВариант.Значение);
	Если ОписаниеФайлаПеречня = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяВременногоФайла	= КаталогВременныхФайлов() + Лев(ОписаниеФайлаПеречня.ИмяФайла, СтрДлина(ОписаниеФайлаПеречня.ИмяФайла) - СтрДлина(ОписаниеФайлаПеречня.Расширение)) + "_" + ВыбранныйВариант.Значение + ОписаниеФайлаПеречня.Расширение;
	ДвоичныеДанные		= ПолучитьИзВременногоХранилища(ОписаниеФайлаПеречня.Адрес);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ЗапуститьПриложение(ИмяВременногоФайла);
КонецПроцедуры

&НаСервере
Функция ПолучитьФайлПеречняНаСервере(НомерПеречня, ИсточникФайла)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
	ИдентификаторПеречня = ОбработкаОбъект["ИдентификаторПеречняПо" + НомерПеречня];
	
	Перечень = ОбработкаОбъект.ПолучитьПереченьПоИдентификатору(ИдентификаторПеречня);
	Если Перечень = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РасширениеФайла		= Сред(Перечень.ИмяФайла, СтрНайти(Перечень.ИмяФайла, ".", НаправлениеПоиска.СКонца));
	ИмяФайла			= Сред(Перечень.ИмяФайла, СтрНайти(Перечень.ИмяФайла, "/", НаправлениеПоиска.СКонца) + 1);	
	ИмяВременногоФайла	= ПолучитьИмяВременногоФайла(РасширениеФайла);
	
	Если ИсточникФайла = "SQL" Тогда  
		РаботаСВнешнимиСистемами.ADODBC_СохранитьМассивБайтВФайл(Перечень.МассивБайт, ИмяВременногоФайла);
	Иначе
		Попытка
			КопироватьФайл(Перечень.ИмяФайла, ИмяВременногоФайла);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения файла '" + Перечень.ИмяФайла + "' с сайта ЦБ РФ. Система сообщает: " + ИнформацияОбОшибке().Описание);
			Возврат Неопределено;	
		КонецПопытки;
	КонецЕсли;
	
	АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), ЭтаФорма.УникальныйИдентификатор);  
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Новый Структура("Адрес, ИмяФайла, Расширение", АдресФайла, ИмяФайла, РасширениеФайла);
КонецФункции

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

#Область СтатистикаРаботыВнутреннихМеханизмов

&НаСервере
Функция ЗарегистрироватьНовуюСессию(ИмяКоманды)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ОбъектОбработки);
	
	Механизм = ОбъектОбработки.Метаданные().ПолноеИмя() + ":" + ИмяКоманды;
	Сессия   = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ПараметрыСессии = Новый Структура;
	ПараметрыСессии.Вставить("Механизм",     Механизм);
	ПараметрыСессии.Вставить("Сессия",        Сессия);
	ПараметрыСессии.Вставить("ДопПараметры",  Неопределено);
	ПараметрыСессии.Вставить("ТекстОшибки",   Неопределено);
		
	Возврат ПараметрыСессии;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗарегистрироватьОкончаниеСессии(ПараметрыСессии)
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(
		ПараметрыСессии.Механизм,
		ПараметрыСессии.Сессия,,
		ПараметрыСессии.ДопПараметры,
		ПараметрыСессии.ТекстОшибки);
	
КонецПроцедуры

#КонецОбласти
